Reports/ОтчетДополнительнаяМаржа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетДополнительнаяМаржа</Name>
		</Properties>
	</Report>
</MetaDataObject>

Documents/Договор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Договор</Name>
			<BasedOn>
				<xr:Item>Document.Спецификация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиФакт</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеИзделия</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановитьНеПозднее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСЮрЛицом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарплатаДизайнера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцевРассрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поделиться</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рассрочка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДополнительноеСоглашение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ДополнительноеСоглашение</Name>
			<BasedOn>
				<xr:Item>Document.Договор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиФакт</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ОтчетДополнительнаяМаржа/Forms/ФормаРасшифровки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Договор = Параметры.Договор;
	ТабДок = СформироватьОтчет(Договор);
КонецПроцедуры

&НаСервере
Функция СформироватьОтчет(Договор)
	
	Макет = Отчеты.ОтчетДополнительнаяМаржа.ПолучитьМакет("Расшифровка");
	
	СтрДоговор = Макет.ПолучитьОбласть("Договор");
	ТабШапка = Макет.ПолучитьОбласть("ТабШапка");
	ТабСтрока = Макет.ПолучитьОбласть("ТабСтрока");
	ТабИтог = Макет.ПолучитьОбласть("ТабИтог");
		
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	
	СтрДоговор.Параметры.Договор = Договор;
	СтрДоговор.Параметры.ДоговорРасшифровка = Договор;
	
	ТабДок.Вывести(СтрДоговор);
	ТабДок.Вывести(ТабШапка);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокДоговор.Ссылка КАК ДоговорСсылка,
	|	ДокДоговор.Спецификация КАК СпецификацияСсылка,
	|	ДокДоговор.СуммаДокумента КАК СуммаПродажи
	|ПОМЕСТИТЬ втДоговоры
	|ИЗ
	|	Документ.АктВыполненияДоговора КАК ДокАкт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Договор КАК ДокДоговор
	|		ПО ДокАкт.Договор = ДокДоговор.Ссылка
	|			И (ДокАкт.Проведен)
	|ГДЕ
	|	ДокДоговор.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительноеСоглашение.Договор КАК ДоговорСсылка,
	|	ДополнительноеСоглашение.Ссылка КАК ДопСоглашениеСсылка,
	|	ДополнительноеСоглашение.СуммаДокумента КАК СуммаПродажи
	|ПОМЕСТИТЬ втДопСоглашения
	|ИЗ
	|	Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение
	|ГДЕ
	|	ДополнительноеСоглашение.Проведен
	|	И ДополнительноеСоглашение.Договор В
	|			(ВЫБРАТЬ
	|				т.ДоговорСсылка
	|			ИЗ
	|				втДоговоры КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Спецификация.Ссылка КАК СпецификацияСсылка,
	|	ЕСТЬNULL(втДоговоры.ДоговорСсылка, Спецификация.ДокументОснование.Договор) КАК ДоговорСсылка,
	|	Спецификация.СуммаДокумента КАК СуммаСпецификации
	|ПОМЕСТИТЬ втСпецификации
	|ИЗ
	|	Документ.Спецификация КАК Спецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДоговоры КАК втДоговоры
	|		ПО (втДоговоры.СпецификацияСсылка = Спецификация.Ссылка)
	|ГДЕ
	|	Спецификация.Проведен
	|	И (втДоговоры.ДоговорСсылка ЕСТЬ НЕ NULL 
	|			ИЛИ Спецификация.ДокументОснование В
	|				(ВЫБРАТЬ
	|					т.ДопСоглашениеСсылка
	|				ИЗ
	|					втДопСоглашения КАК т))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДоговоры.ДоговорСсылка КАК Договор,
	|	втДоговоры.СпецификацияСсылка КАК Спецификация,
	|	втДоговоры.СуммаПродажи,
	|	NULL КАК ДопСоглашение,
	|	0 КАК СуммаСпецификации
	|ИЗ
	|	втДоговоры КАК втДоговоры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втДопСоглашения.ДоговорСсылка,
	|	NULL,
	|	втДопСоглашения.СуммаПродажи,
	|	втДопСоглашения.ДопСоглашениеСсылка,
	|	0
	|ИЗ
	|	втДопСоглашения КАК втДопСоглашения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСпецификации.ДоговорСсылка,
	|	втСпецификации.СпецификацияСсылка,
	|	0,
	|	NULL,
	|	втСпецификации.СуммаСпецификации
	|ИЗ
	|	втСпецификации КАК втСпецификации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуммаПродажи = 0;
	СуммаСпецификации = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Спецификация) Тогда
			ТабСтрока.Параметры.Документ = Выборка.Спецификация;
			ТабСтрока.Параметры.ДокРасшифровка = Выборка.Спецификация;
		Иначе
			ТабСтрока.Параметры.Документ = Выборка.ДопСоглашение;
			ТабСтрока.Параметры.ДокРасшифровка = Выборка.ДопСоглашение;
		КонецЕсли;
		
		ТабСтрока.Параметры.СуммаПродажи = Выборка.СуммаПродажи;
		ТабСтрока.Параметры.СуммаСпецификации = Выборка.СуммаСпецификации;
		
		СуммаПродажи = СуммаПродажи + Выборка.СуммаПродажи;
		СуммаСпецификации = СуммаСпецификации + Выборка.СуммаСпецификации; 
		
		ТабДок.Вывести(ТабСтрока);
		
	КонецЦикла;
		
	ТабИтог.Параметры.СуммаПродажи = СуммаПродажи;
	ТабИтог.Параметры.СуммаСпецификации = СуммаСпецификации;
	ТабИтог.Параметры.Маржа = СуммаПродажи - СуммаСпецификации;
	ТабДок.Вывести(ТабИтог);
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	ОткрытьЗначение(Расшифровка);
КонецПроцедуры
